trainman419/msp430fr2433/msp430fr2433.svd
<?xml version="1.0" encoding="UTF-8"?><device><name>MSP430FR2433</name><size>2</size><resetValue>0</resetValue><access>read-write</access><peripherals><peripheral><name>PORT_1_2</name><description>Port 1/2</description><baseAddress>512</baseAddress><registers><register><name>P1IN</name><description>Port 1 Input</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1IN0</name><description>P1IN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN1</name><description>P1IN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN2</name><description>P1IN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN3</name><description>P1IN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN4</name><description>P1IN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN5</name><description>P1IN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN6</name><description>P1IN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IN7</name><description>P1IN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IN</name><description>Port 2 Input</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2IN0</name><description>P2IN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN1</name><description>P2IN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN2</name><description>P2IN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN3</name><description>P2IN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN4</name><description>P2IN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN5</name><description>P2IN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN6</name><description>P2IN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IN7</name><description>P2IN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1OUT</name><description>Port 1 Output</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1OUT0</name><description>P1OUT0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT1</name><description>P1OUT1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT2</name><description>P1OUT2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT3</name><description>P1OUT3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT4</name><description>P1OUT4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT5</name><description>P1OUT5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT6</name><description>P1OUT6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1OUT7</name><description>P1OUT7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2OUT</name><description>Port 2 Output</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2OUT0</name><description>P2OUT0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT1</name><description>P2OUT1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT2</name><description>P2OUT2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT3</name><description>P2OUT3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT4</name><description>P2OUT4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT5</name><description>P2OUT5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT6</name><description>P2OUT6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2OUT7</name><description>P2OUT7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1DIR</name><description>Port 1 Direction</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1DIR0</name><description>P1DIR0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR1</name><description>P1DIR1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR2</name><description>P1DIR2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR3</name><description>P1DIR3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR4</name><description>P1DIR4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR5</name><description>P1DIR5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR6</name><description>P1DIR6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1DIR7</name><description>P1DIR7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2DIR</name><description>Port 2 Direction</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2DIR0</name><description>P2DIR0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR1</name><description>P2DIR1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR2</name><description>P2DIR2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR3</name><description>P2DIR3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR4</name><description>P2DIR4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR5</name><description>P2DIR5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR6</name><description>P2DIR6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2DIR7</name><description>P2DIR7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1REN</name><description>Port 1 Resistor Enable</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1REN0</name><description>P1REN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN1</name><description>P1REN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN2</name><description>P1REN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN3</name><description>P1REN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN4</name><description>P1REN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN5</name><description>P1REN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN6</name><description>P1REN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1REN7</name><description>P1REN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2REN</name><description>Port 2 Resistor Enable</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2REN0</name><description>P2REN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN1</name><description>P2REN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN2</name><description>P2REN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN3</name><description>P2REN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN4</name><description>P2REN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN5</name><description>P2REN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN6</name><description>P2REN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2REN7</name><description>P2REN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1SEL0</name><description>Port 1 Selection 0</description><addressOffset>10</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1SEL0_0</name><description>P1SEL0_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_1</name><description>P1SEL0_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_2</name><description>P1SEL0_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_3</name><description>P1SEL0_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_4</name><description>P1SEL0_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_5</name><description>P1SEL0_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_6</name><description>P1SEL0_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL0_7</name><description>P1SEL0_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2SEL0</name><description>Port 2 Selection 0</description><addressOffset>11</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2SEL0_0</name><description>P2SEL0_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_1</name><description>P2SEL0_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_2</name><description>P2SEL0_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_3</name><description>P2SEL0_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_4</name><description>P2SEL0_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_5</name><description>P2SEL0_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_6</name><description>P2SEL0_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL0_7</name><description>P2SEL0_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1SEL1</name><description>Port 1 Selection 1</description><addressOffset>12</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1SEL1_0</name><description>P1SEL1_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_1</name><description>P1SEL1_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_2</name><description>P1SEL1_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_3</name><description>P1SEL1_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_4</name><description>P1SEL1_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_5</name><description>P1SEL1_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_6</name><description>P1SEL1_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1SEL1_7</name><description>P1SEL1_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2SEL1</name><description>Port 2 Selection 1</description><addressOffset>13</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2SEL1_0</name><description>P2SEL1_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_1</name><description>P2SEL1_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_2</name><description>P2SEL1_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_3</name><description>P2SEL1_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_4</name><description>P2SEL1_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_5</name><description>P2SEL1_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_6</name><description>P2SEL1_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2SEL1_7</name><description>P2SEL1_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IES</name><description>Port 1 Interrupt Edge Select</description><addressOffset>24</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1IES0</name><description>P1IES0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES1</name><description>P1IES1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES2</name><description>P1IES2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES3</name><description>P1IES3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES4</name><description>P1IES4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES5</name><description>P1IES5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES6</name><description>P1IES6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IES7</name><description>P1IES7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IES</name><description>Port 2 Interrupt Edge Select</description><addressOffset>25</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2IES0</name><description>P2IES0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES1</name><description>P2IES1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES2</name><description>P2IES2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES3</name><description>P2IES3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES4</name><description>P2IES4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES5</name><description>P2IES5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES6</name><description>P2IES6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IES7</name><description>P2IES7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IE</name><description>Port 1 Interrupt Enable</description><addressOffset>26</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1IE0</name><description>P1IE0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE1</name><description>P1IE1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE2</name><description>P1IE2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE3</name><description>P1IE3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE4</name><description>P1IE4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE5</name><description>P1IE5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE6</name><description>P1IE6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IE7</name><description>P1IE7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IE</name><description>Port 2 Interrupt Enable</description><addressOffset>27</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2IE0</name><description>P2IE0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE1</name><description>P2IE1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></fi