trainman419/msp430fr2433/msp430fr2433.svd
eld><field><name>P2IE2</name><description>P2IE2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE3</name><description>P2IE3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE4</name><description>P2IE4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE5</name><description>P2IE5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE6</name><description>P2IE6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IE7</name><description>P2IE7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IFG</name><description>Port 1 Interrupt Flag</description><addressOffset>28</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P1IFG0</name><description>P1IFG0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG1</name><description>P1IFG1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG2</name><description>P1IFG2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG3</name><description>P1IFG3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG4</name><description>P1IFG4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG5</name><description>P1IFG5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG6</name><description>P1IFG6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P1IFG7</name><description>P1IFG7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IFG</name><description>Port 2 Interrupt Flag</description><addressOffset>29</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P2IFG0</name><description>P2IFG0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG1</name><description>P2IFG1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG2</name><description>P2IFG2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG3</name><description>P2IFG3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG4</name><description>P2IFG4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG5</name><description>P2IFG5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG6</name><description>P2IFG6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P2IFG7</name><description>P2IFG7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IV</name><description>Port 1 Interrupt Vector Word</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>P2IV</name><description>Port 2 Interrupt Vector Word</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>PORT_3</name><description>Port 3</description><baseAddress>544</baseAddress><registers><register><name>P3IN</name><description>Port 3 Input</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3IN0</name><description>P3IN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN1</name><description>P3IN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN2</name><description>P3IN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN3</name><description>P3IN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN4</name><description>P3IN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN5</name><description>P3IN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN6</name><description>P3IN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3IN7</name><description>P3IN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3OUT</name><description>Port 3 Output</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3OUT0</name><description>P3OUT0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT1</name><description>P3OUT1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT2</name><description>P3OUT2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT3</name><description>P3OUT3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT4</name><description>P3OUT4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT5</name><description>P3OUT5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT6</name><description>P3OUT6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3OUT7</name><description>P3OUT7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3DIR</name><description>Port 3 Direction</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3DIR0</name><description>P3DIR0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR1</name><description>P3DIR1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR2</name><description>P3DIR2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR3</name><description>P3DIR3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR4</name><description>P3DIR4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR5</name><description>P3DIR5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR6</name><description>P3DIR6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3DIR7</name><description>P3DIR7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3REN</name><description>Port 3 Resistor Enable</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3REN0</name><description>P3REN0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN1</name><description>P3REN1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN2</name><description>P3REN2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN3</name><description>P3REN3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN4</name><description>P3REN4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN5</name><description>P3REN5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN6</name><description>P3REN6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3REN7</name><description>P3REN7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3SEL0</name><description>Port 3 Selection0</description><addressOffset>10</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3SEL0_0</name><description>P3SEL0_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_1</name><description>P3SEL0_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_2</name><description>P3SEL0_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_3</name><description>P3SEL0_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_4</name><description>P3SEL0_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_5</name><description>P3SEL0_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_6</name><description>P3SEL0_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL0_7</name><description>P3SEL0_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3SEL1</name><description>Port 3 Selection1</description><addressOffset>12</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P3SEL1_0</name><description>P3SEL1_0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_1</name><description>P3SEL1_1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_2</name><description>P3SEL1_2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_3</name><description>P3SEL1_3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_4</name><description>P3SEL1_4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_5</name><description>P3SEL1_5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_6</name><description>P3SEL1_6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>P3SEL1_7</name><description>P3SEL1_7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>USCI_A0_UART_MODE</name><description>USCI_A0  UART Mode</description><baseAddress>1280</baseAddress><registers><register><name>UCA0CTL1</name><description>USCI A0 Control Register 1</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0CTL0</name><description>USCI A0 Control Register 0</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0BR0</name><description>USCI A0 Baud Rate 0</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0BR1</name><description>USCI A0 Baud Rate 1</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0STATW</name><description>USCI A0 Status Register</description><addressOffset>10</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>UCBUSY</name><description>USCI Busy Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDR</name><description>USCI Address received Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXERR</name><description>USCI RX Error Flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRK</name><description>USCI Break received</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCPE</name><description>USCI Parity Error Flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOE</name><description>USCI Overrun Error Flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCFE</name><description>USCI Frame Error Flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCLISTEN</name><description>USCI Listen mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>UCA0ABCTL</name><description>USCI A0 LIN Control</description><addressOffset>16</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>UCABDEN</name><description>Auto Baud Rate detect enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBTOE</name><description>Break Timeout error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSTOE</name><description>Sync-Field Timeout error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCDELIM0</name><description>Break Sync Delimiter 0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCDELIM1</name><description>Break Sync Delimiter 1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCA0IRTCTL</name><description>USCI A0 IrDA Transmit Control</description><addressOffset>18</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0IRRCTL</name><description>USCI A0 IrDA Receive Control</description><addressOffset>19</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0CTLW1</name><description>USCI A0 Control Word Register 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCGLIT</name><description>USCI Deglitch Time Bit 1</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>UCGLIT_0</name><description>USCI Deglitch time: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>UCGLIT_1</name><description>USCI Deglitch time: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>UCGLIT_2</name><description>USCI Deglitch time: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>UCGLIT_3</name><description>USCI Deglitch time: 3</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>UCA0MCTLW</name><description>USCI A0 Modulation Control</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCOS16</name><description>USCI 16-times Oversampling enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRF</name><description>USCI First Stage Modulation Select 3</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>UCBRF_0</name><description>USCI First Stage Modulation: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>UCBRF_1</name><description>USCI First Stage Modulation: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>UCBRF_2</name><description>USCI First Stage Modulation: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>UCBRF_3</name><description>USCI First Stage Modulation: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>UCBRF_4</name><description>USCI First Stage Modulation: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>UCBRF_5</name><description>USCI First Stage Modulation: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>UCBRF_6</name><description>USCI First Stage Modulation: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>UCBRF_7</name><description>USCI First Stage Modulation: 7</description><value>7</value></enumeratedValue><enumeratedValue><name>UCBRF_8</name><description>USCI First Stage Modulation: 8</description><value>8</value></enumeratedValue><enumeratedValue><name>UCBRF_9</name><description>USCI First Stage Modulation: 9</description><value>9</value></enumeratedValue><enumeratedValue><name>UCBRF_10</name><description>USCI First Stage Modulation: A</description><value>10</value></enumeratedValue><enumeratedValue><name>UCBRF_11</name><description>USCI First Stage Modulation: B</description><value>11</value></enumeratedValue><enumeratedValue><name>UCBRF_12</name><description>USCI First Stage Modulation: C</description><value>12</value></enumeratedValue><enumeratedValue><name>UCBRF_13</name><description>USCI First Stage Modulation: D</description><value>13</value></enumeratedValue><enumeratedValue><name>UCBRF_14</name><description>USCI First Stage Modulation: E</description><value>14</value></enumeratedValue><enumeratedValue><name>UCBRF_15</name><description>USCI First Stage Modulation: F</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>UCBRS0</name><description>USCI Second Stage Modulation Select 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS1</name><description>USCI Second Stage Modulation Select 1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS2</name><description>USCI Second Stage Modulation Select 2</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS3</name><description>USCI Second Stage Modulation Select 3</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS4</name><description>USCI Second Stage Modulation Select 4</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS5</name><description>USCI Second Stage Modulation Select 5</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS6</name><description>USCI Second Stage Modulation Select 6</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBRS7</name><description>USCI Second Stage Modulation Select 7</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCA0RXBUF</name><description>USCI A0 Receive Buffer</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCA0TXBUF</name><description>USCI A0 Transmit Buffer</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCA0IV</name><description>USCI A0 Interrupt Vector Register</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>USCI_A0_SPI_MODE</name><description>USCI_A0  SPI Mode</description><baseAddress>1280</baseAddress><registers><register><name>UCA0CTL1</name><description>USCI A0 Control Register 1</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0CTL0</name><description>USCI A0 Control Register 0</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCA0BR0</name><description>USCI A0 Baud Rate 0</description><addressOffset>6</addressOffset><size>8</size><resetMask>255