trainman419/msp430fr2433/msp430fr2433.svd
enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCGCEN</name><description>I2C General Call enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0I2COA1</name><description>USCI B0 I2C Own Address 1</description><addressOffset>22</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCOA0</name><description>I2C Own Address Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA1</name><description>I2C Own Address Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA2</name><description>I2C Own Address Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA3</name><description>I2C Own Address Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA4</name><description>I2C Own Address Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA5</name><description>I2C Own Address Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA6</name><description>I2C Own Address Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA7</name><description>I2C Own Address Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA8</name><description>I2C Own Address Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA9</name><description>I2C Own Address Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOAEN</name><description>I2C Own Address enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0I2COA2</name><description>USCI B0 I2C Own Address 2</description><addressOffset>24</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCOA0</name><description>I2C Own Address Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA1</name><description>I2C Own Address Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA2</name><description>I2C Own Address Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA3</name><description>I2C Own Address Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA4</name><description>I2C Own Address Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA5</name><description>I2C Own Address Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA6</name><description>I2C Own Address Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA7</name><description>I2C Own Address Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA8</name><description>I2C Own Address Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA9</name><description>I2C Own Address Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOAEN</name><description>I2C Own Address enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0I2COA3</name><description>USCI B0 I2C Own Address 3</description><addressOffset>26</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCOA0</name><description>I2C Own Address Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA1</name><description>I2C Own Address Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA2</name><description>I2C Own Address Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA3</name><description>I2C Own Address Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA4</name><description>I2C Own Address Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA5</name><description>I2C Own Address Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA6</name><description>I2C Own Address Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA7</name><description>I2C Own Address Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA8</name><description>I2C Own Address Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOA9</name><description>I2C Own Address Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCOAEN</name><description>I2C Own Address enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0ADDRX</name><description>USCI B0 Received Address Register</description><addressOffset>28</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCADDRX0</name><description>I2C Receive Address Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX1</name><description>I2C Receive Address Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX2</name><description>I2C Receive Address Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX3</name><description>I2C Receive Address Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX4</name><description>I2C Receive Address Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX5</name><description>I2C Receive Address Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX6</name><description>I2C Receive Address Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX7</name><description>I2C Receive Address Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX8</name><description>I2C Receive Address Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDRX9</name><description>I2C Receive Address Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0ADDMASK</name><description>USCI B0 Address Mask Register</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCADDMASK0</name><description>I2C Address Mask Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK1</name><description>I2C Address Mask Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK2</name><description>I2C Address Mask Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK3</name><description>I2C Address Mask Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK4</name><description>I2C Address Mask Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK5</name><description>I2C Address Mask Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK6</name><description>I2C Address Mask Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK7</name><description>I2C Address Mask Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK8</name><description>I2C Address Mask Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCADDMASK9</name><description>I2C Address Mask Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0I2CSA</name><description>USCI B0 I2C Slave Address</description><addressOffset>32</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCSA0</name><description>I2C Slave Address Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA1</name><description>I2C Slave Address Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA2</name><description>I2C Slave Address Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA3</name><description>I2C Slave Address Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA4</name><description>I2C Slave Address Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA5</name><description>I2C Slave Address Bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA6</name><description>I2C Slave Address Bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA7</name><description>I2C Slave Address Bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA8</name><description>I2C Slave Address Bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSA9</name><description>I2C Slave Address Bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0IE</name><description>USCI B0 Interrupt Enable Register</description><addressOffset>42</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCB0IE</name><description>USCI B0 Interrupt Enable Register</description><addressOffset>42</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCRXIE0</name><description>I2C Receive Interrupt Enable 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIE0</name><description>I2C Transmit Interrupt Enable 0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSTTIE</name><description>I2C START Condition interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSTPIE</name><description>I2C STOP Condition interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCALIE</name><description>I2C Arbitration Lost interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCNACKIE</name><description>I2C NACK Condition interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBCNTIE</name><description>I2C Automatic stop assertion interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCCLTOIE</name><description>I2C Clock Low Timeout interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIE1</name><description>I2C Receive Interrupt Enable 1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIE1</name><description>I2C Transmit Interrupt Enable 1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIE2</name><description>I2C Receive Interrupt Enable 2</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIE2</name><description>I2C Transmit Interrupt Enable 2</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIE3</name><description>I2C Receive Interrupt Enable 3</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIE3</name><description>I2C Transmit Interrupt Enable 3</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBIT9IE</name><description>I2C Bit 9 Position Interrupt Enable 3</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0IFG</name><description>USCI B0 Interrupt Flags Register</description><addressOffset>44</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCB0IFG</name><description>USCI B0 Interrupt Flags Register</description><addressOffset>44</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCRXIFG0</name><description>I2C Receive Interrupt Flag 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIFG0</name><description>I2C Transmit Interrupt Flag 0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSTTIFG</name><description>I2C START Condition interrupt Flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCSTPIFG</name><description>I2C STOP Condition interrupt Flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCALIFG</name><description>I2C Arbitration Lost interrupt Flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCNACKIFG</name><description>I2C NACK Condition interrupt Flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBCNTIFG</name><description>I2C Byte counter interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCCLTOIFG</name><description>I2C Clock low Timeout interrupt Flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIFG1</name><description>I2C Receive Interrupt Flag 1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIFG1</name><description>I2C Transmit Interrupt Flag 1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIFG2</name><description>I2C Receive Interrupt Flag 2</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIFG2</name><description>I2C Transmit Interrupt Flag 2</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCRXIFG3</name><description>I2C Receive Interrupt Flag 3</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIFG3</name><description>I2C Transmit Interrupt Flag 3</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCBIT9IFG</name><description>I2C Bit 9 Possition Interrupt Flag 3</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0IV</name><description>USCI B0 Interrupt Vector Register</description><addressOffset>46</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>USCI_B0_SPI_MODE</name><description>USCI_B0  SPI Mode</description><baseAddress>1344</baseAddress><registers><register><name>UCB0CTL1</name><description>USCI B0 Control Register 1</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCB0CTL0</name><description>USCI B0 Control Register 0</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCB0BR0</name><description>USCI B0 Baud Rate 0</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCB0BR1</name><description>USCI B0 Baud Rate 1</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>UCB0RXBUF</name><description>USCI B0 Receive Buffer</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCB0TXBUF</name><description>USCI B0 Transmit Buffer</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>UCB0IE</name><description>USCI B0 Interrupt Enable Register</description><addressOffset>42</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCRXIE</name><description>USCI Receive Interrupt Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIE</name><description>USCI Transmit Interrupt Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0IFG</name><description>USCI B0 Interrupt Flags Register</description><addressOffset>44</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>UCRXIFG</name><description>SPI Receive Interrupt Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UCTXIFG</name><description>SPI Transmit Interrupt Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>UCB0IV</name><description>USCI B0 Interrupt Vector Register</description><addressOffset>46</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>SFR</name><description>SFR  Special Function Registers</description><baseAddress>256</baseAddress><registers><register><name>SFRIE1</name><description>Interrupt Enable 1</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>WDTIE</name><description>WDT Interrupt Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OFIE</name><description>Osc Fault Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>VMAIE</name><description>Vacant Memory Interrupt Enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>NMIIE</name><description>NMI Interrupt Enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBINIE</name><description>JTAG Mail Box input Interrupt Enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBOUTIE</name><description>JTAG Mail Box output Interrupt Enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SFRIFG1</name><description>Interrupt Flag 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>WDTIFG</name><description>WDT Interrupt Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OFIFG</name><description>Osc Fault Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>VMAIFG</name><description>Vacant Memory Interrupt Flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>NMIIFG</name><description>NMI Interrupt Flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBINIFG</name><description>JTAG Mail Box input Interrupt Flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write<