trainman419/msp430fr2433/msp430fr2433.svd
/access><enumeratedValues /></field><field><name>JMBOUTIFG</name><description>JTAG Mail Box output Interrupt Flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SFRRPCR</name><description>RESET Pin Control Register</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>SYSNMI</name><description>NMI select</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSNMIIES</name><description>NMI edge select</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSRSTUP</name><description>RESET Pin pull down/up select</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSRSTRE</name><description>RESET Pin Resistor enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>PMM</name><description>PMM  Power Management System</description><baseAddress>288</baseAddress><registers><register><name>PMMCTL0</name><description>PMM Control 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>PMMSWBOR</name><description>PMM Software BOR</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>PMMSWPOR</name><description>PMM Software POR</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>PMMREGOFF</name><description>PMM Turn Regulator off</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SVSHE</name><description>SVS high side enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>PMMCTL1</name><description>PMM Control 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>PMMCTL2</name><description>PMM Control 2</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>INTREFEN</name><description>Internal Reference Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>EXTREFEN</name><description>External Reference output Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>TSENSOREN</name><description>Temperature Sensor Enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>REFGENACT</name><description>REF Reference generator active</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>REFBGACT</name><description>REF Reference bandgap active</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>BGMODE</name><description>REF Bandgap mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>REFGENRDY</name><description>REF Reference generator ready</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>REFBGRDY</name><description>REF Reference bandgap ready</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>PMMIFG</name><description>PMM Interrupt Flag</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>PMMBORIFG</name><description>PMM Software BOR interrupt flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>PMMRSTIFG</name><description>PMM RESET pin interrupt flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>PMMPORIFG</name><description>PMM Software POR interrupt flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SVSHIFG</name><description>SVS low side interrupt flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>PMMLPM5IFG</name><description>LPM5 indication Flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>PMMIE</name><description>PMM Interrupt Enable</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>PM5CTL0</name><description>PMM Power Mode 5 Control Register 0</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>LOCKLPM5</name><description>Lock I/O pin configuration upon entry/exit to/from LPM5</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>LPM5SW</name><description>LPMx.5 switch dis/connected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>LPM5SM</name><description>Manual mode for LPM3.5 switch</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>SYS</name><description>SYS  System Module</description><baseAddress>320</baseAddress><registers><register><name>SYSCTL</name><description>System control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>SYSRIVECT</name><description>SYS - RAM based interrupt vectors</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSPMMPE</name><description>SYS - PMM access protect</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSBSLIND</name><description>SYS - TCK/RST indication detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSJTAGPIN</name><description>SYS - Dedicated JTAG pins enabled</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SYSBSLC</name><description>Boot strap configuration area</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>SYSBSLR</name><description>SYS - RAM assigned to BSL</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSBSLOFF</name><description>SYS - BSL Memory disabled</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SYSBSLPE</name><description>SYS - BSL Memory protection enabled</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SYSJMBC</name><description>JTAG mailbox control</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>JMBIN0FG</name><description>SYS - Incoming JTAG Mailbox 0 Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBIN1FG</name><description>SYS - Incoming JTAG Mailbox 1 Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBOUT0FG</name><description>SYS - Outgoing JTAG Mailbox 0 Flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBOUT1FG</name><description>SYS - Outgoing JTAG Mailbox 1 Flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBMODE</name><description>SYS - JMB 16/32 Bit Mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBCLR0OFF</name><description>SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>JMBCLR1OFF</name><description>SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SYSJMBI0</name><description>JTAG mailbox input 0</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSJMBI1</name><description>JTAG mailbox input 1</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSJMBO0</name><description>JTAG mailbox output 0</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSJMBO1</name><description>JTAG mailbox output 1</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSBERRIV</name><description>Bus Error vector generator</description><addressOffset>24</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSUNIV</name><description>User NMI vector generator</description><addressOffset>26</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSSNIV</name><description>System NMI vector generator</description><addressOffset>28</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSRSTIV</name><description>Reset vector generator</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SYSCFG0</name><description>System Configuration 0</description><addressOffset>32</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>PFWP</name><description>Program FRAM Write Protection</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DFWP</name><description>Data FRAM Write Protection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SYSCFG1</name><description>System Configuration 1</description><addressOffset>34</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>IREN</name><description>Infrared enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>IRPSEL</name><description>Infrared polarity select</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>IRMSEL</name><description>Infrared mode select</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>IRDSSEL</name><description>Infrared data source select</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>IRDATA</name><description>Infrared enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>SYSCFG2</name><description>System Configuration 2</description><addressOffset>36</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCPCTL0</name><description>ADC input A0 pin select</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL1</name><description>ADC input A1 pin select</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL2</name><description>ADC input A2 pin select</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL3</name><description>ADC input A3 pin select</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL4</name><description>ADC input A4 pin select</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL5</name><description>ADC input A5 pin select</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL6</name><description>ADC input A6 pin select</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCPCTL7</name><description>ADC input A7 pin select</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>CS</name><description>CS  Clock System</description><baseAddress>384</baseAddress><registers><register><name>CSCTL0</name><description>CS Control Register 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DCO0</name><description>DCO TAP Bit : 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO1</name><description>DCO TAP Bit : 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO2</name><description>DCO TAP Bit : 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO3</name><description>DCO TAP Bit : 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO4</name><description>DCO TAP Bit : 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO5</name><description>DCO TAP Bit : 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO6</name><description>DCO TAP Bit : 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO7</name><description>DCO TAP Bit : 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCO8</name><description>DCO TAP Bit : 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MOD0</name><description>Modulation Bit Counter Bit : 0</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MOD1</name><description>Modulation Bit Counter Bit : 1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MOD2</name><description>Modulation Bit Counter Bit : 2</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MOD3</name><description>Modulation Bit Counter Bit : 3</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MOD4</name><description>Modulation Bit Counter Bit : 4</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>CSCTL1</name><description>CS Control Register 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DISMOD</name><description>Disable Modulation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>DCORSEL</name><description>DCO frequency range select Bit: 0</description><bitOffset>1</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DCORSEL_0</name><description>DCO frequency range select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>DCORSEL_1</name><description>DCO frequency range select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>DCORSEL_2</name><description>DCO frequency range select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>DCORSEL_3</name><description>DCO frequency range select: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>DCORSEL_4</name><description>DCO frequency range select: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>DCORSEL_5</name><description>DCO frequency range select: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>DCORSEL_6</name><description>DCO frequency range select: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>DCORSEL_7</name><description>DCO frequency range select: 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>DCOFTRIM</name><description>DCO frequency trim. Bit: 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DCOFTRIM_0</name><description>DCO frequency trim: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_1</name><description>DCO frequency trim: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_2</name><description>DCO frequency trim: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_3</name><description>DCO frequency trim: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_4</name><description>DCO frequency trim: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_5</name><description>DCO frequency trim: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_6</name><description>DCO frequency trim: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>DCOFTRIM_7</name><description>DCO frequency trim: 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>DCOFTRIMEN</name><description>DCO frequency trim enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>CSCTL2</name><description>CS Control Register 2</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>FLLN0</name><description>FLL Multipier Bit : 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN1</name><description>FLL Multipier Bit : 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN2</name><description>FLL Multipier Bit : 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN3</name><description>FLL Multipier Bit : 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN4</name><description>FLL Multipier Bit : 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN5</name><description>FLL Multipier Bit : 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN6</name><description>FLL Multipier Bit : 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN7</name><description>FLL Multipier Bit : 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN8</name><description>FLL Multipier Bit : 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLN9</name><description>FLL Multipier Bit : 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLD</name><description>Loop Divider Bit : 0</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>FLLD_0</name><description>Multiply Selected Loop Freq. By 1</description><value>0</value></enumeratedValue><enumeratedValue><name>FLLD_1</name><description>Multiply Selected Loop Freq. By 2</description><value>1</value></enumeratedValue><enumeratedValue><name>FLLD_2</name><description>Multiply Selected Loop Freq. By 4</description><value>2</value></enumeratedValue><enumeratedValue><name>FLLD_3</name><description>Multiply Selected Loop Freq. By 8</description><value>3</value></enumeratedValue><enumeratedValue><name>FLLD_4</name><description>Multiply Selected Loop Freq. By 16</description><value>4</value></enumeratedValue><enumeratedValue><name>FLLD_5</name><description>Multiply Selected Loop Freq. By 32</description><value>5</value></enumeratedValue><enumeratedValue><name>FLLD_6</name><description>Reserved</description><value>6</value></enumeratedValue><enumeratedValue><name>FLLD_7</name><description>Reserved</description><value>7</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>CSCTL3</name><description>CS Control Register 3</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>FLLREFDIV</name><description>Reference Divider Bit : 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>FLLREFDIV_0</name><description>Reference Divider: f(LFCLK)/1</description><value>0</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_1</name><description>Reference Divider: f(LFCLK)/2</description><value>1</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_2</name><description>Reference Divider: f(LFCLK)/4</description><value>2</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_3</name><description>Reference Divider: f(LFCLK)/8</description><value>3</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_4</name><description>Reference Divider: f(LFCLK)/12</description><value>4</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_5</name><description>Reference Divider: f(LFCLK)/16</description><value>5</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_6</name><description>Reference Divider: f(LFCLK)/16</description><value>6</value></enumeratedValue><enumeratedValue><name>FLLREFDIV_7</name><description>Reference Divider: f(LFCLK)/16