trainman419/msp430fr2433/msp430fr2433.svd
</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>SELREF</name><description>FLL Reference Clock Select Bit : 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SELREF_0</name><description>FLL Reference Clock Select 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SELREF_1</name><description>FLL Reference Clock Select 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SELREF_2</name><description>FLL Reference Clock Select 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SELREF_3</name><description>FLL Reference Clock Select 3</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>CSCTL4</name><description>CS Control Register 4</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>SELMS</name><description>MCLK and SMCLK Source Select Bit: 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SELMS_0</name><description>MCLK and SMCLK Source Select 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SELMS_1</name><description>MCLK and SMCLK Source Select 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SELMS_2</name><description>MCLK and SMCLK Source Select 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SELMS_3</name><description>MCLK and SMCLK Source Select 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SELMS_4</name><description>MCLK and SMCLK Source Select 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SELMS_5</name><description>MCLK and SMCLK Source Select 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SELMS_6</name><description>MCLK and SMCLK Source Select 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SELMS_7</name><description>MCLK and SMCLK Source Select 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>SELA</name><description>ACLK Source Select Bit: 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>CSCTL5</name><description>CS Control Register 5</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DIVM</name><description>MCLK Divider Bit: 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DIVM_0</name><description>MCLK Source Divider 0</description><value>0</value></enumeratedValue><enumeratedValue><name>DIVM_1</name><description>MCLK Source Divider 1</description><value>1</value></enumeratedValue><enumeratedValue><name>DIVM_2</name><description>MCLK Source Divider 2</description><value>2</value></enumeratedValue><enumeratedValue><name>DIVM_3</name><description>MCLK Source Divider 3</description><value>3</value></enumeratedValue><enumeratedValue><name>DIVM_4</name><description>MCLK Source Divider 4</description><value>4</value></enumeratedValue><enumeratedValue><name>DIVM_5</name><description>MCLK Source Divider 5</description><value>5</value></enumeratedValue><enumeratedValue><name>DIVM_6</name><description>MCLK Source Divider 6</description><value>6</value></enumeratedValue><enumeratedValue><name>DIVM_7</name><description>MCLK Source Divider 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>DIVS</name><description>SMCLK Divider Bit: 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DIVS_0</name><description>SMCLK Source Divider 0</description><value>0</value></enumeratedValue><enumeratedValue><name>DIVS_1</name><description>SMCLK Source Divider 1</description><value>1</value></enumeratedValue><enumeratedValue><name>DIVS_2</name><description>SMCLK Source Divider 2</description><value>2</value></enumeratedValue><enumeratedValue><name>DIVS_3</name><description>SMCLK Source Divider 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SMCLKOFF</name><description>SMCLK off</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>VLOAUTOOFF</name><description>VLO automatic off enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>CSCTL6</name><description>CS Control Register 6</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>XT1AUTOOFF</name><description>XT1 automatic off enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>XT1AGCOFF</name><description>XT1 Automatic Gain Control (AGC) disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>XT1BYPASS</name><description>XT1 bypass mode : 0: internal 1:sourced from external pin</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>XTS</name><description>1: Selects high-freq. oscillator</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>XT1DRIVE</name><description>XT1 Drive Level mode Bit 0</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>XT1DRIVE_0</name><description>XT1 Drive Level mode: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>XT1DRIVE_1</name><description>XT1 Drive Level mode: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>XT1DRIVE_2</name><description>XT1 Drive Level mode: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>XT1DRIVE_3</name><description>XT1 Drive Level mode: 3</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>CSCTL7</name><description>CS Control Register 7</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DCOFFG</name><description>DCO fault flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>XT1OFFG</name><description>XT1 Low Frequency Oscillator Fault Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLULIFG</name><description>FLL unlock interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ENSTFCNT1</name><description>Enable start counter for XT1</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLUNLOCK</name><description>FLL unlock condition Bit: 0</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>FLLUNLOCK_0</name><description>FLL unlock condition: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>FLLUNLOCK_1</name><description>FLL unlock condition: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>FLLUNLOCK_2</name><description>FLL unlock condition: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>FLLUNLOCK_3</name><description>FLL unlock condition: 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>FLLUNLOCKHIS</name><description>Unlock history Bit: 0</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>FLLUNLOCKHIS_0</name><description>Unlock history: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>FLLUNLOCKHIS_1</name><description>Unlock history: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>FLLUNLOCKHIS_2</name><description>Unlock history: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>FLLUNLOCKHIS_3</name><description>Unlock history: 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>FLLULPUC</name><description>FLL unlock PUC enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FLLWARNEN</name><description>Warning enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>CSCTL8</name><description>CS Control Register 8</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ACLKREQEN</name><description>ACLK Clock Request Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MCLKREQEN</name><description>MCLK Clock Request Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SMCLKREQEN</name><description>SMCLK Clock Request Enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MODOSCREQEN</name><description>MODOSC Clock Request Enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>FRAM</name><description>FRAM</description><baseAddress>416</baseAddress><registers><register><name>FRCTL0</name><description>FRAM Controller Control 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>NWAITS</name><description>FRAM Wait state control Bit: 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>NWAITS_0</name><description>FRAM Wait state control: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>NWAITS_1</name><description>FRAM Wait state control: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>NWAITS_2</name><description>FRAM Wait state control: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>NWAITS_3</name><description>FRAM Wait state control: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>NWAITS_4</name><description>FRAM Wait state control: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>NWAITS_5</name><description>FRAM Wait state control: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>NWAITS_6</name><description>FRAM Wait state control: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>NWAITS_7</name><description>FRAM Wait state control: 7</description><value>7</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>GCCTL0</name><description>General Control 0</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>FRLPMPWR</name><description>FRAM Enable FRAM auto power up after LPM</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>FRPWR</name><description>FRAM Power Control</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ACCTEIE</name><description>RESERVED</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CBDIE</name><description>Enable NMI event if correctable bit error detected</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UBDIE</name><description>Enable NMI event if uncorrectable bit error detected</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UBDRSTEN</name><description>Enable Power Up Clear (PUC) reset if FRAM uncorrectable bit error detected</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>GCCTL1</name><description>General Control 1</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CBDIFG</name><description>FRAM correctable bit error flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>UBDIFG</name><description>FRAM uncorrectable bit error flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ACCTEIFG</name><description>Access time error flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>CRC16</name><description>CRC16</description><baseAddress>448</baseAddress><registers><register><name>CRCDI</name><description>CRC Data In Register</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>CRCDIRB</name><description>CRC data in reverse byte Register</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>CRCINIRES</name><description>CRC Initialisation Register and Result Register</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>CRCRESR</name><description>CRC reverse result Register</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>WATCHDOG_TIMER</name><description>Watchdog Timer</description><baseAddress>460</baseAddress><registers><register><name>WDTCTL</name><description>Watchdog Timer Control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>WDTIS</name><description>WDT - Timer Interval Select 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>WDTIS_0</name><description>WDT - Timer Interval Select: /2G</description><value>0</value></enumeratedValue><enumeratedValue><name>WDTIS_1</name><description>WDT - Timer Interval Select: /128M</description><value>1</value></enumeratedValue><enumeratedValue><name>WDTIS_2</name><description>WDT - Timer Interval Select: /8192k</description><value>2</value></enumeratedValue><enumeratedValue><name>WDTIS_3</name><description>WDT - Timer Interval Select: /512k</description><value>3</value></enumeratedValue><enumeratedValue><name>WDTIS_4</name><description>WDT - Timer Interval Select: /32k</description><value>4</value></enumeratedValue><enumeratedValue><name>WDTIS_5</name><description>WDT - Timer Interval Select: /8192</description><value>5</value></enumeratedValue><enumeratedValue><name>WDTIS_6</name><description>WDT - Timer Interval Select: /512</description><value>6</value></enumeratedValue><enumeratedValue><name>WDTIS_7</name><description>WDT - Timer Interval Select: /64</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>WDTCNTCL</name><description>WDT - Timer Clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>WDTTMSEL</name><description>WDT - Timer Mode Select</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>WDTSSEL</name><description>WDT - Timer Clock Source Select 0</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>WDTSSEL_0</name><description>WDT - Timer Clock Source Select: SMCLK</description><value>0</value></enumeratedValue><enumeratedValue><name>WDTSSEL_1</name><description>WDT - Timer Clock Source Select: ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>WDTSSEL_2</name><description>WDT - Timer Clock Source Select: VLO_CLK</description><value>2</value></enumeratedValue><enumeratedValue><name>WDTSSEL_3</name><description>WDT - Timer Clock Source Select: reserved</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>WDTHOLD</name><description>WDT - Timer hold</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>REAL_TIME_CLOCK</name><description>Real-Time Clock</description><baseAddress>768</baseAddress><registers><register><name>RTCCTL</name><description>RTC control Register</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>RTCIF</name><description>Low-Power-Counter Interrupt Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>RTCIE</name><description>Low-Power-Counter Interrupt Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>RTCSR</name><description>Low-Power-Counter Software Reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>RTCPS</name><description>Low-Power-Counter Clock Pre-divider Select Bit: 0</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>RTCPS_0</name><description>Low-Power-Counter Clock Pre-divider Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>RTCPS_1</name><description>Low-Power-Counter Clock Pre-divider Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>RTCPS_2</name><description>Low-Power-Counter Clock Pre-divider Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>RTCPS_3</name><description>Low-Power-Counter Clock Pre-divider Select: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>RTCPS_4</name><description>Low-Power-Counter Clock Pre-divider Select: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>RTCPS_5</name><description>Low-Power-Counter Clock Pre-divider Select: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>RTCPS_6</name><description>Low-Power-Counter Clock Pre-divider Select: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>RTCPS_7</name><description>Low-Power-Counter Clock Pre-divider Select: 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>RTCSS</name><description>Low-Power-Counter Clock Source Select Bit: 0</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>RTCSS_0</name><description>Low-Power-Counter Clock Source Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>RTCSS_1</name><description>Low-Power-Counter Clock Source Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>RTCSS_2</name><description>Low-Power-Counter Clock Source Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>RTCSS_3</name><description>Low-Power-Counter Clock Source Select: 3</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>RTCIV</name><description>RTC interrupt vector</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RTCMOD</name><description>RTC moduloRegister</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RTCCNT</name><description>RTC counter Register</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>TIMER_0_A3</name><description>Timer0_A3</description><baseAddress>896</baseAddress><registers><register><name>TA0CTL</name><description>Timer0_A3 Control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>TAIFG</name><description>Timer A counter interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>TAIE</name><description>Timer A counter interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>TACLR</name><description>Timer A counter clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MC</name><description>Timer A mode control 1</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>MC_0</name><description>Timer A mode control: 0 - Stop</description><value>0</value></enumeratedValue><enumeratedValue><name>MC_1</name><description>Timer A mode control: 1 - Up to CCR0</description><value>1</value></enumeratedValue><enumeratedValue><name>MC_2</name><description>Timer A mode control: 2 - Continuous up</description><value>2</value></enumeratedValue><enumeratedValue><name>MC_3</name><description>Timer A mode control: 3 - Up/Down</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ID</name><description>Timer A clock input divider 1</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ID_0</name><description>Timer A input divider: 0 - /1</description><value>0</value></enumeratedValue><enumeratedValue><name>ID_1</name><description>Timer A input divider: 1 - /2</description><value>1</value></enumeratedValue><enumeratedValue><name>ID_2</name><description>Timer A input divider: 2 - /4</description><value>2</value></enumeratedValue><enumeratedValue><name>ID_3</name><description>Timer A input divider: 3 - /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>TASSEL</name><description>Timer A clock source select 1</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TASSEL_0</name><description>Timer A clock source select: 0 - TACLK</description><value>0</value></enumeratedValue><enumeratedValue><name>TASSEL_1</name><description>Timer A clock source select: 1 - ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>TASSEL_2</name><description>Timer A clock source select: 2 - SMCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>TASSEL_3</name><description>Timer A clock source select: 3 - INCLK</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA0CCTL0</name><description>Timer0_A3 Capture/Compare Control 0</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitW