trainman419/msp430fr2433/msp430fr2433.svd
idth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA0CCTL1</name><description>Timer0_A3 Capture/Compare Control 1</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA0CCTL2</name><description>Timer0_A3 Capture/Compare Control 2</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA0R</name><description>Timer0_A3</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA0CCR0</name><description>Timer0_A3 Capture/Compare 0</description><addressOffset>18</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA0CCR1</name><description>Timer0_A3 Capture/Compare 1</description><addressOffset>20</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA0CCR2</name><description>Timer0_A3 Capture/Compare 2</description><addressOffset>22</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA0EX0</name><description>Timer0_A3 Expansion Register 0</description><addressOffset>32</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>TAIDEX</name><description>Timer A Input divider expansion Bit: 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TAIDEX_0</name><description>Timer A Input divider expansion : /1</description><value>0</value></enumeratedValue><enumeratedValue><name>TAIDEX_1</name><description>Timer A Input divider expansion : /2</description><value>1</value></enumeratedValue><enumeratedValue><name>TAIDEX_2</name><description>Timer A Input divider expansion : /3</description><value>2</value></enumeratedValue><enumeratedValue><name>TAIDEX_3</name><description>Timer A Input divider expansion : /4</description><value>3</value></enumeratedValue><enumeratedValue><name>TAIDEX_4</name><description>Timer A Input divider expansion : /5</description><value>4</value></enumeratedValue><enumeratedValue><name>TAIDEX_5</name><description>Timer A Input divider expansion : /6</description><value>5</value></enumeratedValue><enumeratedValue><name>TAIDEX_6</name><description>Timer A Input divider expansion : /7</description><value>6</value></enumeratedValue><enumeratedValue><name>TAIDEX_7</name><description>Timer A Input divider expansion : /8</description><value>7</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA0IV</name><description>Timer0_A3 Interrupt Vector Word</description><addressOffset>46</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>TIMER_1_A3</name><description>Timer1_A3</description><baseAddress>960</baseAddress><registers><register><name>TA1CTL</name><description>Timer1_A3 Control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>TAIFG</name><description>Timer A counter interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>TAIE</name><description>Timer A counter interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>TACLR</name><description>Timer A counter clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MC</name><description>Timer A mode control 1</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>MC_0</name><description>Timer A mode control: 0 - Stop</description><value>0</value></enumeratedValue><enumeratedValue><name>MC_1</name><description>Timer A mode control: 1 - Up to CCR0</description><value>1</value></enumeratedValue><enumeratedValue><name>MC_2</name><description>Timer A mode control: 2 - Continuous up</description><value>2</value></enumeratedValue><enumeratedValue><name>MC_3</name><description>Timer A mode control: 3 - Up/Down</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ID</name><description>Timer A clock input divider 1</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ID_0</name><description>Timer A input divider: 0 - /1</description><value>0</value></enumeratedValue><enumeratedValue><name>ID_1</name><description>Timer A input divider: 1 - /2</description><value>1</value></enumeratedValue><enumeratedValue><name>ID_2</name><description>Timer A input divider: 2 - /4</description><value>2</value></enumeratedValue><enumeratedValue><name>ID_3</name><description>Timer A input divider: 3 - /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>TASSEL</name><description>Timer A clock source select 1</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TASSEL_0</name><description>Timer A clock source select: 0 - TACLK</description><value>0</value></enumeratedValue><enumeratedValue><name>TASSEL_1</name><description>Timer A clock source select: 1 - ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>TASSEL_2</name><description>Timer A clock source select: 2 - SMCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>TASSEL_3</name><description>Timer A clock source select: 3 - INCLK</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA1CCTL0</name><description>Timer1_A3 Capture/Compare Control 0</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA1CCTL1</name><description>Timer1_A3 Capture/Compare Control 1</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><n