trainman419/msp430fr2433/msp430fr2433.svd
et>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ID_0</name><description>Timer A input divider: 0 - /1</description><value>0</value></enumeratedValue><enumeratedValue><name>ID_1</name><description>Timer A input divider: 1 - /2</description><value>1</value></enumeratedValue><enumeratedValue><name>ID_2</name><description>Timer A input divider: 2 - /4</description><value>2</value></enumeratedValue><enumeratedValue><name>ID_3</name><description>Timer A input divider: 3 - /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>TASSEL</name><description>Timer A clock source select 1</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TASSEL_0</name><description>Timer A clock source select: 0 - TACLK</description><value>0</value></enumeratedValue><enumeratedValue><name>TASSEL_1</name><description>Timer A clock source select: 1 - ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>TASSEL_2</name><description>Timer A clock source select: 2 - SMCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>TASSEL_3</name><description>Timer A clock source select: 3 - INCLK</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA3CCTL0</name><description>Timer3_A2 Capture/Compare Control 0</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA3CCTL1</name><description>Timer3_A2 Capture/Compare Control 1</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA3R</name><description>Timer3_A2</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA3CCR0</name><description>Timer3_A2 Capture/Compare 0</description><addressOffset>18</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA3CCR1</name><description>Timer3_A2 Capture/Compare 1</description><addressOffset>20</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TA3EX0</name><description>Timer3_A2 Expansion Register 0</description><addressOffset>32</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>TAIDEX</name><description>Timer A Input divider expansion Bit: 0</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TAIDEX_0</name><description>Timer A Input divider expansion : /1</description><value>0</value></enumeratedValue><enumeratedValue><name>TAIDEX_1</name><description>Timer A Input divider expansion : /2</description><value>1</value></enumeratedValue><enumeratedValue><name>TAIDEX_2</name><description>Timer A Input divider expansion : /3</description><value>2</value></enumeratedValue><enumeratedValue><name>TAIDEX_3</name><description>Timer A Input divider expansion : /4</description><value>3</value></enumeratedValue><enumeratedValue><name>TAIDEX_4</name><description>Timer A Input divider expansion : /5</description><value>4</value></enumeratedValue><enumeratedValue><name>TAIDEX_5</name><description>Timer A Input divider expansion : /6</description><value>5</value></enumeratedValue><enumeratedValue><name>TAIDEX_6</name><description>Timer A Input divider expansion : /7</description><value>6</value></enumeratedValue><enumeratedValue><name>TAIDEX_7</name><description>Timer A Input divider expansion : /8</description><value>7</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TA3IV</name><description>Timer3_A2 Interrupt Vector Word</description><addressOffset>46</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>MPY_16</name><description>MPY 16  Multiplier  16 Bit Mode</description><baseAddress>1216</baseAddress><registers><register><name>MPY</name><description>Multiply Unsigned/Operand 1</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPYS</name><description>Multiply Signed/Operand 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MAC</name><description>Multiply Unsigned and Accumulate/Operand 1</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MACS</name><description>Multiply Signed and Accumulate/Operand 1</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>OP2</name><description>Operand 2</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RESLO</name><description>Result Low Word</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RESHI</name><description>Result High Word</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SUMEXT</name><description>Sum Extend</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPY32CTL0</name><description>MPY32 Control Register 0</description><addressOffset>44</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>MPYC</name><description>Carry of the multiplier</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MPYFRAC</name><description>Fractional mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MPYSAT</name><description>Saturation mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MPYM</name><description>Multiplier mode Bit:0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>MPYM_0</name><description>Multiplier mode: MPY</description><value>0</value></enumeratedValue><enumeratedValue><name>MPYM_1</name><description>Multiplier mode: MPYS</description><value>1</value></enumeratedValue><enumeratedValue><name>MPYM_2</name><description>Multiplier mode: MAC</description><value>2</value></enumeratedValue><enumeratedValue><name>MPYM_3</name><description>Multiplier mode: MACS</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>OP1_32</name><description>Bit-width of operand 1 0:16Bit / 1:32Bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>OP2_32</name><description>Bit-width of operand 2 0:16Bit / 1:32Bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MPYDLYWRTEN</name><description>Delayed write enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>MPYDLY32</name><description>Delayed write mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register></registers></peripheral><peripheral><name>MPY_32</name><description>MPY 32  Multiplier  32 Bit Mode</description><baseAddress>1232</baseAddress><registers><register><name>MPY32L</name><description>32-bit operand 1 - multiply - low word</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPY32H</name><description>32-bit operand 1 - multiply - high word</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPYS32L</name><description>32-bit operand 1 - signed multiply - low word</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPYS32H</name><description>32-bit operand 1 - signed multiply - high word</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MAC32L</name><description>32-bit operand 1 - multiply accumulate - low word</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MAC32H</name><description>32-bit operand 1 - multiply accumulate - high word</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MACS32L</name><description>32-bit operand 1 - signed multiply accumulate - low word</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MACS32H</name><description>32-bit operand 1 - signed multiply accumulate - high word</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>OP2L</name><description>32-bit operand 2 - low word</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>OP2H</name><description>32-bit operand 2 - high word</description><addressOffset>18</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RES0</name><description>32x32-bit result 0 - least significant word</description><addressOffset>20</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RES1</name><description>32x32-bit result 1</description><addressOffset>22</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RES2</name><description>32x32-bit result 2</description><addressOffset>24</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RES3</name><description>32x32-bit result 3 - most significant word</description><addressOffset>26</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>BACKUP_MEMORY</name><description>Backup Memory</description><baseAddress>1632</baseAddress><registers><register><name>BAKMEM0</name><description>Battery Backup Memory 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM1</name><description>Battery Backup Memory 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM2</name><description>Battery Backup Memory 2</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM3</name><description>Battery Backup Memory 3</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM4</name><description>Battery Backup Memory 4</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM5</name><description>Battery Backup Memory 5</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM6</name><description>Battery Backup Memory 6</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM7</name><description>Battery Backup Memory 7</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM8</name><description>Battery Backup Memory 8</description><addressOffset>16</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM9</name><description>Battery Backup Memory 9</description><addressOffset>18</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM10</name><description>Battery Backup Memory 10</description><addressOffset>20</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM11</name><description>Battery Backup Memory 11</description><addressOffset>22</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM12</name><description>Battery Backup Memory 12</description><addressOffset>24</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM13</name><description>Battery Backup Memory 13</description><addressOffset>26</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM14</name><description>Battery Backup Memory 14</description><addressOffset>28</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>BAKMEM15</name><description>Battery Backup Memory 15</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>ADC</name><description>ADC</description><baseAddress>1792</baseAddress><registers><register><name>ADCCTL0</name><description>ADC Control 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCSC</name><description>ADC Start Conversion</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCENC</name><description>ADC Enable Conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCON</name><description>ADC On/enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCMSC</name><description>ADC Multiple SampleConversion</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCSHT</name><description>ADC Sample Hold Select Bit: 0</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCSHT_0</name><description>ADC Sample Hold Select 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCSHT_1</name><description>ADC Sample Hold Select 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCSHT_2</name><description>ADC Sample Hold Select 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCSHT_3</name><description>ADC Sample Hold Select 3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADCSHT_4</name><description>ADC Sample Hold Select 4</description><value>4</value></enumeratedValue><enumeratedValue><name>ADCSHT_5</name><description>ADC Sample Hold Select 5</description><value>5</value></enumeratedValue><enumeratedValue><name>ADCSHT_6</name><description>ADC Sample Hold Select 6</description><value>6</value></enumeratedValue><enumeratedValue><name>ADCSHT_7</name><description>ADC Sample Hold Select 7</description><value>7</value></enumeratedValue><enumeratedValue><name>ADCSHT_8</name><description>ADC Sample Hold Select 8</description><value>8</value></enumeratedValue><enumeratedValue><name>ADCSHT_9</name><description>ADC Sample Hold Select 9</description><value>9</value></enumeratedValue><enumeratedValue><name>ADCSHT_10</name><description>ADC Sample Hold Select 10</description><value>10</value></enumeratedValue><enumeratedValue><name>ADCSHT_11</name><description>ADC Sample Hold Select 11</description><value>11</value></enumeratedValue><enumeratedValue><name>ADCSHT_12</name><description>ADC Sample Hold Select 12</description><value>12</value></enumeratedValue><enumeratedValue><name>ADCSHT_13</name><description>ADC Sample Hold Select 13</description><value>13</value></enumeratedValue><enumeratedValue><name>ADCSHT_14</na