trainman419/msp430fr2433/msp430fr2433.svd
me><description>ADC Sample Hold Select 14</description><value>14</value></enumeratedValue><enumeratedValue><name>ADCSHT_15</name><description>ADC Sample Hold Select 15</description><value>15</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>ADCCTL1</name><description>ADC Control 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCBUSY</name><description>ADC Busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCCONSEQ</name><description>ADC Conversion Sequence Select 0</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCCONSEQ_0</name><description>ADC Conversion Sequence Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCCONSEQ_1</name><description>ADC Conversion Sequence Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCCONSEQ_2</name><description>ADC Conversion Sequence Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCCONSEQ_3</name><description>ADC Conversion Sequence Select: 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ADCSSEL</name><description>ADC Clock Source Select 0</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCSSEL_0</name><description>ADC Clock Source Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCSSEL_1</name><description>ADC Clock Source Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCSSEL_2</name><description>ADC Clock Source Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCSSEL_3</name><description>ADC Clock Source Select: 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ADCDIV</name><description>ADC Clock Divider Select 0</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCDIV_0</name><description>ADC Clock Divider Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCDIV_1</name><description>ADC Clock Divider Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCDIV_2</name><description>ADC Clock Divider Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCDIV_3</name><description>ADC Clock Divider Select: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADCDIV_4</name><description>ADC Clock Divider Select: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>ADCDIV_5</name><description>ADC Clock Divider Select: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>ADCDIV_6</name><description>ADC Clock Divider Select: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>ADCDIV_7</name><description>ADC Clock Divider Select: 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>ADCISSH</name><description>ADC Invert Sample Hold Signal</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCSHP</name><description>ADC Sample/Hold Pulse Mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCSHS</name><description>ADC Sample/Hold Source 0</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCSHS_0</name><description>ADC Sample/Hold Source: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCSHS_1</name><description>ADC Sample/Hold Source: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCSHS_2</name><description>ADC Sample/Hold Source: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCSHS_3</name><description>ADC Sample/Hold Source: 3</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>ADCCTL2</name><description>ADC Control 2</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCSR</name><description>ADC Sampling Rate</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCDF</name><description>ADC Data Format</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCRES</name><description>ADC Resolution</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCRES_0</name><description>8 bit</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCRES_1</name><description>10 bit</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCRES_2</name><description>Reserved</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCRES_3</name><description>Reserved</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ADCPDIV</name><description>ADC predivider Bit: 0</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCPDIV_0</name><description>ADC predivider /1</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCPDIV_1</name><description>ADC predivider /2</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCPDIV_2</name><description>ADC predivider /64</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCPDIV_3</name><description>ADC predivider reserved</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>ADCLO</name><description>ADC Window Comparator High Threshold</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADCHI</name><description>ADC Window Comparator High Threshold</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADCMCTL0</name><description>ADC Memory Control 0</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCINCH</name><description>ADC Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCINCH_0</name><description>ADC Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCINCH_1</name><description>ADC Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCINCH_2</name><description>ADC Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCINCH_3</name><description>ADC Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADCINCH_4</name><description>ADC Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>ADCINCH_5</name><description>ADC Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>ADCINCH_6</name><description>ADC Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>ADCINCH_7</name><description>ADC Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>ADCINCH_8</name><description>ADC Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>ADCINCH_9</name><description>ADC Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>ADCINCH_10</name><description>ADC Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>ADCINCH_11</name><description>ADC Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>ADCINCH_12</name><description>ADC Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>ADCINCH_13</name><description>ADC Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>ADCINCH_14</name><description>ADC Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>ADCINCH_15</name><description>ADC Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>ADCSREF</name><description>ADC Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADCSREF_0</name><description>ADC Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADCSREF_1</name><description>ADC Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADCSREF_2</name><description>ADC Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADCSREF_3</name><description>ADC Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADCSREF_4</name><description>ADC Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>ADCSREF_5</name><description>ADC Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>ADCSREF_6</name><description>ADC Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>ADCSREF_7</name><description>ADC Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>ADCMEM0</name><description>ADC Conversion Memory 0</description><addressOffset>18</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADCIE</name><description>ADC Interrupt Enable</description><addressOffset>26</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCIE0</name><description>ADC Interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCINIE</name><description>ADC Interrupt enable for the inside of window of the Window comparator</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCLOIE</name><description>ADC Interrupt enable for lower threshold of the Window comparator</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCHIIE</name><description>ADC Interrupt enable for upper threshold of the Window comparator</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCOVIE</name><description>ADC ADCMEM overflow Interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCTOVIE</name><description>ADC conversion-time-overflow Interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>ADCIFG</name><description>ADC Interrupt Flag</description><addressOffset>28</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADCIFG0</name><description>ADC Interrupt Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCINIFG</name><description>ADC Interrupt Flag for the inside of window of the Window comparator</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCLOIFG</name><description>ADC Interrupt Flag for lower threshold of the Window comparator</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCHIIFG</name><description>ADC Interrupt Flag for upper threshold of the Window comparator</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCOVIFG</name><description>ADC ADCMEM overflow Interrupt Flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field><field><name>ADCTOVIFG</name><description>ADC conversion-time-overflow Interrupt Flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues /></field></fields></register><register><name>ADCIV</name><description>ADC Interrupt Vector Word</description><addressOffset>30</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>_INTERRUPTS</name><baseAddress>65408</baseAddress><interrupt><name>PORT2</name><description>0xFFDA Port 2</description><value>41</value></interrupt><interrupt><name>PORT1</name><description>0xFFDC Port 1</description><value>42</value></interrupt><interrupt><name>ADC</name><description>0xFFDE ADC</description><value>43</value></interrupt><interrupt><name>USCI_B0</name><description>0xFFE0 USCI B0 Receive/Transmit</description><value>44</value></interrupt><interrupt><name>USCI_A1</name><description>0xFFE2 USCI A1 Receive/Transmit</description><value>45</value></interrupt><interrupt><name>USCI_A0</name><description>0xFFE4 USCI A0 Receive/Transmit</description><value>46</value></interrupt><interrupt><name>WDT</name><description>0xFFE6 Watchdog Timer</description><value>47</value></interrupt><interrupt><name>RTC</name><description>0xFFE8 RTC</description><value>48</value></interrupt><interrupt><name>TIMER3_A1</name><description>0xFFEA Timer3_A2 CC1, TA</description><value>49</value></interrupt><interrupt><name>TIMER3_A0</name><description>0xFFEC Timer3_A2 CC0</description><value>50</value></interrupt><interrupt><name>TIMER2_A1</name><description>0xFFEE Timer2_A2 CC1, TA</description><value>51</value></interrupt><interrupt><name>TIMER2_A0</name><description>0xFFF0 Timer2_A2 CC0</description><value>52</value></interrupt><interrupt><name>TIMER1_A1</name><description>0xFFF2 Timer1_A3 CC1-2, TA</description><value>53</value></interrupt><interrupt><name>TIMER1_A0</name><description>0xFFF4 Timer1_A3 CC0</description><value>54</value></interrupt><interrupt><name>TIMER0_A1</name><description>0xFFF6 Timer0_A3 CC1-2, TA</description><value>55</value></interrupt><interrupt><name>TIMER0_A0</name><description>0xFFE8 Timer0_A3 CC0</description><value>56</value></interrupt><interrupt><name>UNMI</name><description>0xFFFA User Non-maskable</description><value>57</value></interrupt><interrupt><name>SYSNMI</name><description>0xFFFC System Non-maskable</description><value>58</value></interrupt></peripheral></peripherals></device>
